Tekla Open API Reference for Tekla Structures 2025
GridLine.GridLabel.OffsetGridPoint Property
 The grid line point where the grid line actually ends, with offsets applied.
 Namespace: Tekla.Structures.Drawing
 Assembly: Tekla.Structures.Drawing (in Tekla.Structures.Drawing.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
public Point OffsetGridPoint { get; }
Public ReadOnly Property OffsetGridPoint As Point
	Get
Property Value
Type: Point
See Also
Reference
GridLine.GridLabel Class
Tekla.Structures.Drawing Namespace